In [127]:
# Categorical variables
# OneHoteEncoding
# Dummy Variables
# LabelEncoder

import numpy as np
import pandas as pd

df = pd.read_csv('houseprices.csv')
df.head(5)

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [128]:
# get dummy columns for a categorical col
dummies = pd.get_dummies(df['town'])

new_df = pd.concat([df,dummies], axis= 1)
new_df.head()

              town  area   price  monroe township  robinsville  west windsor
0  monroe township  2600  550000                1            0             0
1  monroe township  3000  565000                1            0             0
2  monroe township  3200  610000                1            0             0
3  monroe township  3600  680000                1            0             0
4  monroe township  4000  725000                1            0             0

In [129]:

new_df.drop(['town','west windsor'],inplace = True,axis = 1)
new_df

    area   price  monroe township  robinsville
0   2600  550000                1            0
1   3000  565000                1            0
2   3200  610000                1            0
3   3600  680000                1            0
4   4000  725000                1            0
5   2600  585000                0            0
6   2800  615000                0            0
7   3300  650000                0            0
8   3600  710000                0            0
9   2600  575000                0            1
10  2900  600000                0            1
11  3100  620000                0            1
12  3600  695000                0            1

In [130]:
from sklearn.linear_model import LinearRegression


x= new_df.drop('price', axis ='columns')
y = new_df.price
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [131]:
model = LinearRegression()
model.fit(x,y)

LinearRegression()

In [132]:
model.predict([[2000,1,0]])

array([463571.27499465])

In [133]:
model.score(x,y)

0.9573929037221873

In [134]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [135]:
df.town = le.fit_transform(df.town)
df.head()

   town  area   price
0     0  2600  550000
1     0  3000  565000
2     0  3200  610000
3     0  3600  680000
4     0  4000  725000

In [150]:
x = df[['town','area']]
y = df.price
x
#model.fit(x,y)

    town  area
0      0  2600
1      0  3000
2      0  3200
3      0  3600
4      0  4000
5      2  2600
6      2  2800
7      2  3300
8      2  3600
9      1  2600
10     1  2900
11     1  3100
12     1  3600

In [162]:
from sklearn.preprocessing import OneHotEncoder

ohe = OneHotEncoder(sparse = False).fit(x[['town']])

ohe.transform(x[['town']])

x = pd.concate

array([[1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 1., 0.],
       [0., 1., 0.],
       [0., 1., 0.]])

In [153]:
ohe

OneHotEncoder()

In [155]:
ohe.categories_

[array([0, 1, 2])]